<template>
  <div class="index-ceo container" id="ceo-text">
    <div class="index-ceo__wrapper">
      <div class="index-ceo__title g-title" v-t="'Текст для СЕО'" />
      <accordion :show-button="false" :max-height="112" :init-check="false" @set-hidden="onSetHidden" ref="accordion">
        <div class="index-ceo__text">
          <span>
            Интернет-магазин Wildberries – это доступные цены, широкий, регулярно обновляемый ассортимент.
            В онлайн-каталоге Wildberries представлено около 35 000 ведущих брендов женской, мужской и детской одежды и обуви.
            Покупателям предлагается электроника, книжная продукция, детские товары. В интернет-магазине можно приобрести продукцию
            для дома, продукты питания, товары для красоты, ювелирные изделия, игрушки.
            Для удобства пользования онлайн-каталог поделенна разделы, все товары можно сортировать
          </span>
          <template v-if="!isHidden">
            <span> по ряду критериев:цена, материал изготовления, сезонность, бренд.</span>
            <span class="index-ceo__subtitle">Выгодный шопинг</span>
            <span>
              Интернет-магазин Wildberries регулярно проводит масштабные распродажи.
              В рамках таких акций предоставляются большие скидки (до 95%) на одежду, обувь, детские товары.
              Условия распродаж распространяются и на электронику, продукты питания, товары для дома, книги и многое другое.
              Чтобы быть в курсе предстоящих скидок или появления в ассортименте новых моделей от любимых брендов, достаточно
              подписаться на email-рассылку. Интернет-магазин одежды своевременно информирует получателей рассылки о распродажах,
              обновлении ассортимента. Дополнительные выгодные условия действуют для постоянных покупателей Wildberries – персональная
              скидка, зависящая от процента выкупа вещей. В Wildberries всегда ответственно подходят к выбору поставщиков, со многими
              производителями мы работаем напрямую, поэтому все категории товаров отличаются высоким качеством, разнообразием моделей
              и цветов, доступными ценами.
            </span>
            <span class="index-ceo__subtitle">Доставка и оплата без проблем</span>
            <span>
              Онлайн-магазин Wildberries осуществляет бесплатную доставку по всей России с помощью собственной курьерской службы.
              Покупатель может также забрать заказ из пункта выдачи заказов. Любую одежду, обувь и другие товары можно примерить
              перед оплатой заказа курьеру или в пункте выдачи заказа, оборудованном удобными примерочными.
              Wildberries предлагает несколько различных вариантов оплаты заказа как при оформлении, так и по факту при получении,
              - банковскими картой или переводом, наличным расчетом или электронным платежом. Если товар не подошел, его можно вернуть
              с курьером как до оплаты заказа, так и после по почте или в одном из 7000 пунктов выдачи заказа в течение 21 дня.
            </span>
          </template>
          <button
            class="g-accordion__btn index-ceo__btn"
            :class="{active: !isHidden, floating: isHidden}"
            @click="toggle"
          >
            <span>{{ isHidden ? $t('Развернуть') : $t('Свернуть') }}</span>
            <ArrowDownIcon />
          </button>
        </div>
      </accordion>
    </div>
  </div>
</template>

<script>
export default {
  name: "Ceo",

  components: {
    ArrowDownIcon: () => import('~/assets/icons/arrow-down.svg?inline'),
    Accordion: () => import('~/components/elements/Accordion')
  },

  data() {
    return {
      isHidden: true
    }
  },

  methods: {
    onSetHidden (hidden) {
      this.isHidden = hidden;
    },

    toggle () {
      this.$refs.accordion.toggle();
      if (this.isHidden && window.innerWidth <= 600) {
        setTimeout(() => {
          this.$scrollTo('#ceo-text', { offset: -100 })
        }, 300)
      }
    }
  }
}
</script>

<style lang="scss">
@import "~/assets/styles/containers/ceo";
</style>
